{
  "users": {
    "686a3c86aca22a450a06ee8d": {
      "username": "VanijTarnakij",
      "email": "tarnakit.vanij@g.swu.ac.th",
      "full_name": "Tarnakij Pornvoravanij",
      "hashed_password": "$2b$12$6RnGrpvpz3ADiLmRxuu2V.IVnAm6yRVgPCFIk2TSASO2OIi/zpIRK",
      "role": "member",
      "is_active": true,
      "created_at": "2025-07-06T09:06:14.492626",
      "updated_at": "2025-07-06T09:06:14.492630",
      "_id": "686a3c86aca22a450a06ee8d",
      "last_login": "2025-07-06T10:08:47.313708"
    }
  },
  "teams": {
    "686a3c9faca22a450a06ee8e": {
      "name": "Test",
      "description": "A",
      "owner_id": "686a3c86aca22a450a06ee8d",
      "members": [],
      "created_at": "2025-07-06T09:06:39.127380",
      "updated_at": "2025-07-06T09:06:39.127382",
      "_id": "686a3c9faca22a450a06ee8e"
    },
    "686a3cafaca22a450a06ee8f": {
      "name": "TestB",
      "description": "B",
      "owner_id": "686a3c86aca22a450a06ee8d",
      "members": [],
      "created_at": "2025-07-06T09:06:55.568827",
      "updated_at": "2025-07-06T09:06:55.568831",
      "_id": "686a3cafaca22a450a06ee8f"
    }
  },
  "notes": {
    "686a3d60aca22a450a06ee91": {
      "title": "Yūdachi",
      "content": "For other ships with the same name, see American destroyer Yūdachi.\n\nYūdachi underway on 30 November 1936\nHistory\nEmpire of Japan\nName\tYūdachi\nNamesake\t夕立 (\"Evening Squall\")[1]\nOrdered\t1931 FY\nBuilder\tSasebo Naval Arsenal\nLaid down\t16 October 1934\nLaunched\t21 June 1936\nCommissioned\t7 January 1937\nStricken\t15 December 1942\nFate\tSunk by USS Portland, 13 November 1942\nGeneral characteristics\nClass & type\tShiratsuyu-class destroyer\nDisplacement\t1,685 long tons (1,712 t)\nLength\t\n103.5 m (340 ft) pp\n107.5 m (352 ft 8 in) waterline\nBeam\t9.9 m (32 ft 6 in)\nDraft\t3.5 m (11 ft 6 in)\nPropulsion\t\n2 shaft Kampon geared turbines\n3 boilers, 42,000 hp (31,000 kW)\nSpeed\t34 knots (39 mph; 63 km/h)\nRange\t4,000 nmi (7,400 km) at 18 kn (33 km/h)\nComplement\t226\nArmament\t\n5 × 12.7 cm/50 Type 3 naval guns (2×2, 1×1)\n2 × 13.2 mm (0.52 in) AA guns\n8 × 24 in (610 mm) torpedo tubes\n16 × Depth charges\nService record\nOperations:\t\nBattle of Tarakan (1942)\nBattle of the Java Sea (1942)\nBattle of Midway (1942)\nBattle of the Santa Cruz Islands (1942)\nFirst Naval Battle of Guadalcanal (1942)\nYūdachi (夕立, \"Evening Squall\")[1] was the fourth of ten Shiratsuyu-class destroyers built for the Imperial Japanese Navy under the \"Circle One\" Program (Maru Ichi Keikaku).[2]\n\nDesign Background\nThe Shiratsuyu-class destroyers were modified versions of the Hatsuharu class, and were designed to accompany the Japanese main striking force and to conduct both day and night torpedo attacks against the United States Navy as it advanced across the Pacific Ocean, according to Japanese naval strategic projections.[3] Despite being one of the most powerful classes of destroyers in the world at the time of their completion, none survived the Pacific War.[4] Yūdachi, built at the Sasebo Naval Arsenal was laid down on 16 October 1934, launched on 21 June 1936 and commissioned on 7 January 1937.[5]\n\nOperational history\nAt the time of the attack on Pearl Harbor, Yūdachi was assigned to Destroyer Division 2 of Destroyer Squadron 2 of the IJN 2nd Fleet together with her sister ships Murasame, Harusame, and Samidare, and had sortied from Mako Guard District as part of the \"Operation M\" (the invasion of the Philippines). From January 1942, Yūdachi participated in operations in the Netherlands East Indies, including the invasions of Tarakan, Balikpapan and eastern Java. During the Battle of the Java Sea, Yūdachi engaged a group of Allied destroyers and cruisers. Returning to Subic Bay in the Philippines on 16 March, Yūdachi assisted in the blockade of Manila Bay and the invasion of Cebu, returning to Yokosuka for repairs in early May. During the Battle of Midway on 4–6 June, Yūdachi was part of the Midway Occupation Force under the overall command of Admiral Nobutake Kondō.\n\nFrom mid-June, Yūdachi deployed from Kure via Singapore and Mergui for raiding operations in the Indian Ocean, but the operation was cancelled due to reverses suffered by the Imperial Japanese Navy in the Solomon Islands. Yūdachi arrived at Shortland Island on 30 August, and was immediately assigned to \"Tokyo Express\" high speed transport runs to Guadalcanal.\n\nSinking of USS Gregory and USS Little\nIn the night of September 4–5, Yūdachi along with the destroyers Hatsuyuki and Murakumo had completed a transport mission running troops and supplies to Guadalcanal, and were preparing a bombardment on Henderson Field, a former Japanese air base which was captured by US forces and being use against Japanese shipping to great effect. They were underway when they encountered the elderly destroyers USS Gregory and USS Little on patrol duty. An American aircraft attempted to silhouette the Japanese ships but dropped five flares too close to the US destroyers, lighting up both ships and resulting in Yūdachi and the other destroyers opening fire.[6]\n\nGregory attempted to fire on the Japanese destroyers, but within just three minutes was blasted by 12.7 cm (5 in) gunfire from the three ships and shot into a floating wreck. Little managed to survive longer, but Yūdachi, Hatsuyuki, and Murakumo quickly switched fire and shelled Little as well, setting her aflame. Both ships began to sink as the Japanese destroyers opened fire at the escaping crew, killing several American sailors. Throughout the engagement, Yūdachi claimed primary credit for both Gregory and Little's sinking.[6][7]\n\nYūdachi continued making missions to Guadalcanal through November, participating briefly in the Battle of the Santa Cruz Islands on 26 October under Admiral Takeo Kurita.\n\nNaval battle of Guadalcanal\nMain article: Naval Battle of Guadalcanal\nOn the night of 12–13 November 1942, in the First Naval Battle of Guadalcanal, Yūdachi escorted the Bombardment Force of Rear Admiral Abe Hiroaki. The lead ship in the formation at beginning of battle, Yūdachi had to swerve to avoid U.S. ships, then torpedoed the cruiser USS Portland. Yūdachi then mistook the destroyer USS Sterett for a friendly ship and flashed its recognition signals. Sterett fired back, hitting Yūdachi's #1 boiler room, leaving the ship dead in the water. After Yūdachi was disabled, 207 survivors were removed by Samidare, which then failed to scuttle her with three torpedoes.[8] The abandoned hulk was later sunk by gunfire of Portland, southeast of Savo Island at position (09°14′S 159°52′E). According to James Hornfischer, Yūdachi was showing a white flag before Portland fired (the apparent \"white flag\" was a makeshift sail used in an attempt to get back underway during the battle), but this was deliberately ignored by Captain Laurance T. DuBose, who directed his gunnery officer to \"sink the S.O.B.\".[9]",
      "topic_id": "686a3d22aca22a450a06ee90",
      "team_id": "686a3c9faca22a450a06ee8e",
      "created_by": "686a3c86aca22a450a06ee8d",
      "collaborators": [],
      "fact_checks": [
        {
          "id": "686a3d8eaca22a450a06ee92",
          "claim": "Overall content accuracy",
          "status": "verified",
          "explanation": "The majority of the provided information on the Japanese destroyer Yūdachi is verifiable and consistent with known historical accounts. However, some claims, particularly regarding the sinking of the USS Gregory and USS Little and the precise circumstances surrounding Yūdachi's sinking, require further verification with specific citations to fully confirm their accuracy.  Overall, the provided information paints a generally accurate picture of the ship's history and role in the Pacific War.",
          "sources": [],
          "confidence": 0.9,
          "checked_at": "2025-07-06 09:10:38.273468",
          "checked_by": "686a3c86aca22a450a06ee8d"
        },
        {
          "id": "686a3dd0aca22a450a06ee93",
          "claim": "Overall content accuracy",
          "status": "questionable",
          "explanation": "The provided text offers a generally accurate account of the Yūdachi's history, but some key claims regarding her sinking and involvement in specific engagements lack sufficient verifiable evidence. While the technical details and operational timeline largely hold up, the narrative surrounding the sinking needs more robust sourcing to resolve ambiguities.",
          "sources": [],
          "confidence": 0.85,
          "checked_at": "2025-07-06 09:11:44.388163",
          "checked_by": "686a3c86aca22a450a06ee8d"
        }
      ],
      "comments": [],
      "versions": [],
      "created_at": "2025-07-06T09:09:52.773370",
      "updated_at": "2025-07-06T09:11:44.388177",
      "_id": "686a3d60aca22a450a06ee91",
      "status": "draft"
    }
  },
  "topics": {
    "686a3d22aca22a450a06ee90": {
      "name": "A",
      "description": "A",
      "tags": [
        "A"
      ],
      "team_id": "686a3c9faca22a450a06ee8e",
      "created_by": "686a3c86aca22a450a06ee8d",
      "created_at": "2025-07-06T09:08:50.703346",
      "updated_at": "2025-07-06T09:08:50.703353",
      "_id": "686a3d22aca22a450a06ee90"
    }
  }
}